Revit 2027 API
ExternalServices.BuiltInExternalServices.WallPlacementPostProcessingService Property
 Autodesk Internal: The service for post processing something after placing a wall
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId WallPlacementPostProcessingService { get; }
Public Shared ReadOnly Property WallPlacementPostProcessingService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ WallPlacementPostProcessingService {
	ExternalServiceId^ get ();
}
static member WallPlacementPostProcessingService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace